# GetOpenings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionCreationData..::..GetOpenings Method
IFCExtrusionCreationData Class See Also
---
Gets a collection of all of the openings stored in this data.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<IFCExtrusionData> GetOpenings()
```

Visual Basic
---
```text
Public Function GetOpenings As IList(Of IFCExtrusionData)
```

Visual C++
---
```text
public:
IList<IFCExtrusionData^>^ GetOpenings()
```

# ### Return Value
The opening information.
# Remarks
Contains all of the openings stored via AddOpening().
# See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace